# Filename: ~/mydotfiles/os/macos/packages/homebrew/00-base/Brewfile
# Local base package list.

# Adding taps (repos) on top as I was getting errors
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "FelixKratz/formulae"

brew "wget"
# coreutils includes ls with colors, not needed since I now use eza
# brew "coreutils"
brew "fzf"
brew "git"
# yarn requires node
brew "node"
brew "starship"
brew "tmux"
brew "sesh"
brew "direnv"
brew "tree"
brew "watch"
# karabiner uses yarn to install depencencies
brew "yarn"
# Smart cd replacement used optionally by sesh and Kitty session scripts
# brew "z.lua"
brew "zoxide"
# Cat with wings
brew "bat"
# Replacement for ls
brew "eza"
brew "zsh-autosuggestions"
brew "zsh-vi-mode"
brew "wordnet"
cask "kitty"
cask "wezterm"
cask "ghostty"
cask "coconutbattery"

brew "jq"
brew "shellcheck"
brew "sketchybar"
