alexdauenhauer.catppuccin-noctis-icons
be5invis.vscode-custom-css
brandonkirbyson.vscode-animations
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
chadalen.vscode-jetbrains-icon-theme
dautroc.yazi-vscode
davidanson.vscode-markdownlint
esbenp.prettier-vscode
github.copilot
github.copilot-chat
gxl.git-graph-3
icsharpcode.ilspy-vscode
impasse52.catppuccin-mocha-darker
josemurilloc.aura-spirit-dracula
justusadam.language-haskell
kilocode.kilo-code
miguelsolorio.fluent-icons
ms-azuretools.vscode-containers
ms-dotnettools.vscode-dotnet-runtime
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ritwickdey.liveserver
subframe7536.custom-ui-style
tomoki1207.pdf
usernamehw.errorlens
vspacecode.whichkey
yesitsfebreeze.smearcursor
adampan.vibrancy-continued
